app/views/tasks/index.html.erb

      <%= label_tag :category, "Filter by Category" %>
      <%= select_tag :category, options_from_collection_for_select(Category.all, :id, :name, params[:category]), include_blank: true %>
---
SELECT "categories".* FROM "categories"

      <%= label_tag :status, "Filter by Status" %>
      <%= select_tag :status, options_for_select(Task.statuses.keys.map { |status| [status.humanize, status] }, params[:status]), include_blank: true %>
---
SELECT "tasks".* FROM "tasks" ORDER BY "tasks"."status" DESC