app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?) RETURNING "id"  [["name", "Homework"], ["created_at", "2024-10-04 01:05:45.206106"], ["updated_at", "2024-10-04 01:05:45.206106"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Challenges"], ["updated_at", "2024-10-05 02:52:23.220375"], ["id", 4]]