app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."status" = ?  [["status", 2]]
SELECT "tasks".* FROM "tasks"
SELECT "categories".* FROM "categories"
SELECT "tasks".* FROM "tasks" WHERE "tasks"."category_id" = ? AND "tasks"."status" = ?  [["category_id", 1], ["status", 0]]
SELECT "tasks".* FROM "tasks" ORDER BY "description" DESC
---
  def index
    @sort_order = params[:order] == 'desc' ? 'desc' : 'asc'
    @tasks = Task.order(status: @sort_order)
    @tasks = Task.all

    if params[:category].present?
      @tasks = @tasks.where(category_id: params[:category])
    end

    if params[:status].present?
      @tasks = @tasks.where(status: params[:status])
    end

    case params[:order]
    when 'description_asc'
      @tasks = @tasks.order(description: :asc)

SELECT "categories".* FROM "categories"
---
  def new
    @task = Task.new
    @categories = Category.all

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"
---
  def edit
    @task = Task.find(params[:id])
    @categories = Category.all

INSERT INTO "tasks" ("name", "is_completed", "category_id", "created_at", "updated_at", "status") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "ideation challenge"], ["is_completed", nil], ["category_id", 5], ["created_at", "2024-10-08 09:25:02.152938"], ["updated_at", "2024-10-08 09:25:02.152938"], ["status", 2]]
---
  def create
    @task = Task.new(task_params)
    if @task.save

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "is_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_completed", 1], ["updated_at", "2024-10-08 09:12:15.366811"], ["id", 2]]
---
  def update
    @task = Task.find(params[:id])
    @categories = Category.all
    if @task.update(task_params)

DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 4]]
---
  def destroy
    @task.destroy!

UPDATE "tasks" SET "is_completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["is_completed", 1], ["updated_at", "2024-10-08 09:19:04.964357"], ["id", 1]]
---
  def toggle_completed
    @task.update(is_completed: !@task.is_completed)